<a href="https://colab.research.google.com/github/akshithamaddi/Akshitha_INFO5731_Spring2020/blob/master/Copy_of_In_class_exercise_04.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **The fourth in-class-exercise**

# 1. Text Data Preprocessing

Here is a [legal case](https://github.com/unt-iialab/INFO5731_Spring2020/blob/master/In_class_exercise/01-05-1%20%20Adams%20v%20Tanner.txt) we collected from westlaw, please follow the steps we mentioned in lesson 5 to clean the data:



## 1.1 Basic feature extraction using text data

*   Number of sentences
*   Number of words
*   Number of characters
*   Average word length
*   Number of stopwords
*   Number of special characters
*   Number of numerics
*   Number of uppercase words

## 1.2 Basic Text Pre-processing of text data

*   Lower casing
*   Punctuation removal
*   Stopwords removal
*   Frequent words removal
*   Rare words removal
*   Spelling correction
*   Tokenization
*   Stemming
*   Lemmatization

## 1.3 Save all the **clean sentences** to a **csv file** (one column, each raw is a sentence) after finishing all the steps above.


## 1.4 Advance Text Processing

*   Calculate the term frequency of all the terms.
*   Print out top 10 1-gram, top 10 2-grams, and top 10 2-grams terms as features.

In [158]:

import spacy
import pandas as pd
from collections import Counter
import re
import csv

data = open('testfile.txt').read()
lines_of_data = data.splitlines()
tmp = []
for i in range(len(lines_of_data)):
    tmp.append(lines_of_data[i])    
data_df = pd.DataFrame(tmp) 
data_df.to_csv('test.csv')
df = pd.read_csv('test.csv')

#number of sentences
lines, blanklines, sentences, words = 0, 0, 0, 0
for line in data:
  lines += 1
  if line.startswith('\n'):
    blanklines += 1
  else:
    sentences += line.count('.') + line.count('!') + line.count('?')
print("no of Sentences : ", sentences)

no of Sentences :  292

In [159]:
#number of words
df['word_count'] = df['0'].apply(lambda x: len(str(x).split(" ")))
df[['0','word_count']].head()
df = df.dropna()
df[['0','word_count']].head()

                           0  word_count
1                 5 Ala. 740           3
2  Supreme Court of Alabama.           4
3                      ADAMS           1
4                         v.           1
5         TANNER AND HORTON.           3

In [160]:
#number of characters
df['char_count'] = df['0'].str.len()
df[['0','char_count']].head()

                           0  char_count
1                 5 Ala. 740          10
2  Supreme Court of Alabama.          25
3                      ADAMS           5
4                         v.           2
5         TANNER AND HORTON.          18

In [161]:
#average word length
def avg_word(sentence):
  words = sentence.split()
  try:
        return (sum(len(word) for word in words)/len(words))
  except ZeroDivisionError:
        return -1
df['avg_word'] = df['0'].apply(lambda x: avg_word(x))
df[['0','avg_word']].head()

                           0  avg_word
1                 5 Ala. 740  2.666667
2  Supreme Court of Alabama.  5.500000
3                      ADAMS  5.000000
4                         v.  2.000000
5         TANNER AND HORTON.  5.333333

In [162]:
#number of stopwords
from nltk.corpus import stopwords
import nltk
nltk.download('stopwords')
stop = stopwords.words('english')
df['stopwords'] = df['0'].apply(lambda x: len([x for x in x.split() if x in stop]))
df[['0','stopwords']].head()

[nltk_data] Downloading package stopwords to /root/nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

                           0  stopwords
1                 5 Ala. 740          0
2  Supreme Court of Alabama.          1
3                      ADAMS          0
4                         v.          0
5         TANNER AND HORTON.          0

In [163]:
#number of special charcaters 
df['hastags'] = df['0'].apply(lambda x: len([x for x in x.split() if x.startswith('#')]))
df[['0','hastags']].head()

                           0  hastags
1                 5 Ala. 740        0
2  Supreme Court of Alabama.        0
3                      ADAMS        0
4                         v.        0
5         TANNER AND HORTON.        0

In [164]:
#number of numerics
df['numerics'] = df['0'].apply(lambda x: len([x for x in x.split() if x.isdigit()]))
df[['0','numerics']].head()

                           0  numerics
1                 5 Ala. 740         2
2  Supreme Court of Alabama.         0
3                      ADAMS         0
4                         v.         0
5         TANNER AND HORTON.         0

In [165]:
#number of uppercase words
df['upper'] = df['0'].apply(lambda x: len([x for x in x.split() if x.isupper()]))
df[['0','upper']].head()

                           0  upper
1                 5 Ala. 740      0
2  Supreme Court of Alabama.      0
3                      ADAMS      1
4                         v.      0
5         TANNER AND HORTON.      3

In [166]:
#lower casing
df['0'] = df['0'].str.lower()
df['0'].head()

1                   5 ala. 740
2    supreme court of alabama.
3                        adams
4                           v.
5           tanner and horton.
Name: 0, dtype: object

In [167]:
#punctutaion removal
df['0'] = df['0'].str.replace('[^\w\s]',' ')
df['0'].head()

1                   5 ala  740
2    supreme court of alabama
3                        adams
4                           v
5           tanner and horton
Name: 0, dtype: object

In [168]:
#stopwords removal
stop = stopwords.words('english')
df['0'] = df['0'].apply(lambda x: " ".join(x for x in x.split() if x not in stop))
df['0']

1                                5 ala 740
2                    supreme court alabama
3                                    adams
4                                        v
5                            tanner horton
                      ...
154                       filings citation
155                     negative treatment
156    negative treatment results citation
157                                history
158               history results citation
Name: 0, Length: 148, dtype: object

In [169]:
#frequent words removal
freq = pd.Series(' '.join(df['0']).split()).value_counts()[:10]
freq = list(freq.index)
df['0'] = df['0'].apply(lambda x: " ".join(x for x in x.split() if x not in freq))
df['0'].head()

1          5 ala 740
2    supreme alabama
3              adams
4
5      tanner horton
Name: 0, dtype: object

In [170]:
#rare words removal
rare = pd.Series(' '.join(df['0']).split()).value_counts()[-10:]
rare = list(rare.index)
df['0'] = df['0'].apply(lambda x: " ".join(x for x in x.split() if x not in freq))
df['0'].head()

1          5 ala 740
2    supreme alabama
3              adams
4
5      tanner horton
Name: 0, dtype: object

In [171]:
#spelling correction
from textblob import TextBlob
df['0'][:10].apply(lambda x: str(TextBlob(x).correct()))

1                     5 all 740
2               supreme alabama
3                         adams
4
5                 manner norton
6                june term 1843
7                       sycosis
8     writ error circuit sumter
9
12             west headnotes 2
Name: 0, dtype: object

In [172]:
#tokenization
import nltk
nltk.download('punkt')
TextBlob(df['0'][1]).words

[nltk_data] Downloading package punkt to /root/nltk_data...
[nltk_data]   Package punkt is already up-to-date!

WordList(['5', 'ala', '740'])

In [173]:
#stemming
from nltk.stem import PorterStemmer
st = PorterStemmer()
df['0'][:10].apply(lambda x: " ".join([st.stem(word) for word in x.split()]))

1                     5 ala 740
2                suprem alabama
3                          adam
4
5                 tanner horton
6                june term 1843
7                       synopsi
8     writ error circuit sumter
9
12               west headnot 2
Name: 0, dtype: object

In [174]:
#lemmatization
from textblob import Word
import nltk
nltk.download('wordnet')

df['0'] = df['0'].apply(lambda x: " ".join([Word(word).lemmatize() for word in x.split()]))
df['0'].head()

[nltk_data] Downloading package wordnet to /root/nltk_data...
[nltk_data]   Package wordnet is already up-to-date!

1          5 ala 740
2    supreme alabama
3               adam
4
5      tanner horton
Name: 0, dtype: object

In [0]:
#adding a new column to csv after cleaning the data
csv_input = pd.read_csv('test.csv')
csv_input['clean_data'] = df['0']
csv_input.to_csv('test.csv', index=False)

In [176]:
#term frequency
tf1 = (df['0'][1:2]).apply(lambda x: pd.value_counts(x.split(" "))).sum(axis = 0).reset_index()
tf1.columns = ['words','tf']
tf1

     words  tf
0  alabama   1
1  supreme   1

In [177]:
from nltk.util import ngrams
print("Top 10 1 grams",TextBlob(df['0'][1]).ngrams(1),TextBlob(df['0'][2]).ngrams(1),TextBlob(df['0'][3]).ngrams(1),TextBlob(df['0'][4]).ngrams(1),
      TextBlob(df['0'][5]).ngrams(1),TextBlob(df['0'][6]).ngrams(1),TextBlob(df['0'][7]).ngrams(1),TextBlob(df['0'][8]).ngrams(1),
      TextBlob(df['0'][9]).ngrams(1))
print("Top 10 2 grams",TextBlob(df['0'][1]).ngrams(2),TextBlob(df['0'][2]).ngrams(2),TextBlob(df['0'][3]).ngrams(2),TextBlob(df['0'][2]).ngrams(2),
      TextBlob(df['0'][5]).ngrams(2),TextBlob(df['0'][6]).ngrams(2),TextBlob(df['0'][7]).ngrams(2),TextBlob(df['0'][8]).ngrams(2),
      TextBlob(df['0'][9]).ngrams(2))
print("Top 10 3 grams",TextBlob(df['0'][1]).ngrams(3),TextBlob(df['0'][2]).ngrams(3),TextBlob(df['0'][3]).ngrams(3),TextBlob(df['0'][4]).ngrams(3),
      TextBlob(df['0'][5]).ngrams(1),TextBlob(df['0'][6]).ngrams(3),TextBlob(df['0'][7]).ngrams(3),TextBlob(df['0'][8]).ngrams(3),
      TextBlob(df['0'][9]).ngrams(3))

Top 10 1 grams [WordList(['5']), WordList(['ala']), WordList(['740'])] [WordList(['supreme']), WordList(['alabama'])] [WordList(['adam'])] [] [WordList(['tanner']), WordList(['horton'])] [WordList(['june']), WordList(['term']), WordList(['1843'])] [WordList(['synopsis'])] [WordList(['writ']), WordList(['error']), WordList(['circuit']), WordList(['sumter'])] []
Top 10 2 grams [WordList(['5', 'ala']), WordList(['ala', '740'])] [WordList(['supreme', 'alabama'])] [] [WordList(['supreme', 'alabama'])] [WordList(['tanner', 'horton'])] [WordList(['june', 'term']), WordList(['term', '1843'])] [] [WordList(['writ', 'error']), WordList(['error', 'circuit']), WordList(['circuit', 'sumter'])] []
Top 10 3 grams [WordList(['5', 'ala', '740'])] [] [] [] [WordList(['tanner']), WordList(['horton'])] [WordList(['june', 'term', '1843'])] [] [WordList(['writ', 'error', 'circuit']), WordList(['error', 'circuit', 'sumter'])] []

# 2. Python Regular Expression

## 2.1 Write a Python program to remove leading zeros from an IP address. 

ip = "260.08.094.109"

In [178]:
def noleadingZeros(ip): 
	noleadingZeroes_ip = ".".join([str(int(i)) for i in ip.split(".")]) 
	return noleadingZeroes_ip ; 
ip ="260.08.094.109"
print(noleadingZeros(ip))

260.8.94.109

**bold text**## 2.2 Write a Python Program to extract all the years from the following sentence.

sentence = "The 2010s were a dramatic decade, filled with ups and downs, more than 1000 stroies have happened. As the decade comes to a close, Insider took a look back at some of the biggest headline-grabbing stories, from 2010 to 2019. The result was 119 news stories that ranged from the heartwarming rescue of a Thai boys' soccer team from a flooded cave to the divisive election of President Donald Trump."

In [179]:
import re
sentence = "The 2010s were a dramatic decade, filled with ups and downs, more than 1000 stroies have happened. As the decade comes to a close, Insider took a look back at some of the biggest headline-grabbing stories, from 2010 to 2019. The result was 119 news stories that ranged from the heartwarming rescue of a Thai boys' soccer team from a flooded cave to the divisive election of President Donald Trump."
year = re.findall('(\d{4})',sentence)
year[:] = [x for x in year if "1000" not in x]
year

['2010', '2010', '2019']